<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">
<html>
<head>
<title>The OCS/OASYS Mini-Tutorial</title>
</head>

<body bgcolor=FFFFFF>

<h3>Getting started with the <code>oasys</code> tool (<img src="new.gif"> in 2.3a)</h3>

The <code>oasys</code> tool is an alternative to the
<code>ocs</code> command. It provides particularly useful functionality
for interactive program development. Its interpreter-debugger allows to
expressions to be evaluated `on the fly' or the execution of
functions to be monitored.
<p>

In contrast to <code>ocs</code>, <code>oasys</code> is not
batch-oriented, but has its own command line interpreter (which is
effectively a Tcl interpreter).  The most important commands have
one-letter abbreviations; some of these are:

<dl>
<dt> <code><b>a STRUCTURE</b></code>
<dd> <i>add</i> STRUCTURE (and its dependent structures) to the set of known
	structures

<dt> <b><code>f UNIT</code></b> 

<dd> define UNIT (a structure's signature or implementation part) as
<i>focus</i> (context) for the evaluation of expressions

<dt> <b><code>e EXPR</code></b>
<dd> <i>evaluate</i> EXPR 

<dt> <b><code>h CMD</code></b>
<dd> give <i>help</i> on <code>oasys</code> command CMD

<dt> <b><code> i </code></b>
<dd> print a short <i>introduction</i> to <code>oasys</code> commands

<dt> <b><code>q</code></b>
<dd> <i>quit</i> <code>oasys</code>
</dl>

<h4>Example</h4>
	
<p>For demonstration we use the structure Rational:</p>

<pre>
   $ cd examples/Rational
   $ oasys
-> oasys version 1.1a (ocs version 2.3a), (c) 1989-1997 The OPAL Group, TU-Berlin
-> >
</pre>

<p>Firstly, we have to add the structure Rational to the set of known
      structures:</p>

<pre>
   >a Rational
-> loading Rational.sign
-> loading Rational.impl
-> >
</pre>

<p>Secondly, we choose one of the loaded units as the focus, that is, the
context for the evaluation of expressions. The signature part imports
integers to allow basic evaluations:
      </p>
<pre>
   >f Rational.sign
-> Rational.sign>
</pre>

<p> The prompt changes and indicates the current focus. Now we can
    evaluate Opal expressions. Before every evaluation, the
    structures are checked and recompiled, if necessary: </p>

<pre>
   Rational.sign>e 6 / 8 + 5 / 4
-> checking Rational.sign
-> checking Rational.impl
-> compiling Rational.impl
-> starting evaluator process
-> 2/1
-> Rational.sign>
</pre>

<p>Subsequent evaluations are quicker:</p>

<pre>
   Rational.sign>e 3 / 5 * 5 / 4
-> 3/4
-> Rational.sign>
</pre>

<p>Spaces or quotes may require
      expressions to be enclosed in curly brackets:</p>
<pre>
   Rational.sign>e {("4711"!) / 12 + 5 / 3}
-> 1577/4
-> Rational.sign>
</pre>

<p>Errors in the evaluated expression are reported at line 0:</p>

<pre>
   Rational.sign>e a + b
-> ERROR [at 0.1]: no matching operation for a
-> ERROR [at 0.5]: no matching operation for b
-> ERROR [check]: language error
-> aborted
-> Rational.sign>
</pre>

<h4>Further Topics</h4>

<p>For further documentation of the following topics we refer to the 
  <a href="OasysManual.html" target="OPAL_index_body">Oasys Manual</a>. </p>

<ul>
<li> Debugging Opal functions
<li> Executing monadic expressions
<li> Linking executable programs
<li> Customizing <code>oasys</code> (see also <code>examples/Integrator</code>)
<li> Handling structures in multiple directories 
</ul>

<hr>
<address><a href="mailto:opal@cs.tu-berlin.de">The Opal Group</a></address>
<!-- Created: Fri Oct 10 21:50:37 MET DST 1997 -->
<!-- hhmts start -->
Last modified: Tue Nov 25 17:03:10 1997
<!-- hhmts end -->
</body>
</html>
